#pragma once
#include <QStringList>

enum EmoEnum {
    anger = 0,
    fear,
    sadness,
    joy,
    love
};

const QStringList EmoAnger =
{
    "-----",
    "Бешенство",
    "Ярость",
    "Ненависть",
    "Истерия",
    "Злость",
    "Раздражение",
    "Презрение",
    "Негодование",
    "Обида",
    "Ревность",
    "Уязвимость",
    "Досада",
    "Зависть",
    "Неприязнь",
    "Возмущение",
    "Отвращение"
};

const QStringList EmoFear =
{
    "-----",
    "Ужас",
    "Отчаяние",
    "Испуг",
    "Оцепенение",
    "Подозрение",
    "Тревога",
    "Ошарашенность",
    "Беспокойство",
    "Боязнь",
    "Унижение",
    "Замешательство",
    "Растерянность",
    "Вина",
    "Стыд",
    "Сомнение",
    "Застенчивость",
    "Опасение",
    "Смущение",
    "Сломленность",
    "Подвох",
    "Надменность",
    "Ошеломленность"
};

const QStringList EmoSadness =
{
    "-----",
    "Горечь",
    "Тоска",
    "Скорбь",
    "Лень",
    "Жалость",
    "Отрешенность",
    "Отчаяние",
    "Беспомощность",
    "Душевная боль",
    "Безнадежность",
    "Отчужденность",
    "Разочарование",
    "Потрясение",
    "Сожаление",
    "Скука",
    "Безысходность",
    "Печаль",
    "Загнаность"
};

const QStringList EmoJoy =
{
    "-----",
    "Счастье",
    "Восторг",
    "Ликование",
    "Приподнятость",
    "Оживление",
    "Умиротворение",
    "Увленение",
    "Интерес",
    "Забота",
    "Ожидание",
    "Возбуждение",
    "Предвкушение",
    "Надежда",
    "Любопытство",
    "Освобождение",
    "Принятие",
    "Нетерпение",
    "Вера",
    "Изумление"
};

const QStringList EmoLove =
{
    "-----",
    "Нежность",
    "Теплота",
    "Сочувствие",
    "Блаженство",
    "Доверие",
    "Безопасность",
    "Благодарность",
    "Спокойствие",
    "Симпатия",
    "Идентичность",
    "Гордость",
    "Восхищение",
    "Уважение",
    "Самоценность",
    "Влюбленность",
    "Любовь к себе",
    "Очарованность",
    "Смирение",
    "Искренность",
    "Дружелюбие",
    "Доброта",
    "Взаимовыручка",
    "Трепет"
};
